Update architecture draft
